In [1]:
import numpy as np
import pandas as pd

In [10]:
data = [1,2,3,4,5]

In [13]:
df = pd.DataFrame(data, columns=["variableName"] )

In [14]:
df

   variableName
0             1
1             2
2             3
3             4
4             5

In [30]:
data2 = np.arange(10)

In [34]:
data2=data2.reshape(5,2)

In [35]:
df2 = pd.DataFrame(data2, columns= ["colOne","colTwo"])

In [36]:
df2

   colOne  colTwo
0       0       1
1       2       3
2       4       5
3       6       7
4       8       9

In [37]:
df2.columns = ["newColOne","newColTwo"]

In [38]:
df2

   newColOne  newColTwo
0          0          1
1          2          3
2          4          5
3          6          7
4          8          9

In [39]:
type(df2)

pandas.core.frame.DataFrame

In [40]:
df2.keys

<bound method NDFrame.keys of    newColOne  newColTwo
0          0          1
1          2          3
2          4          5
3          6          7
4          8          9>

In [41]:
df2.axes

[RangeIndex(start=0, stop=5, step=1),
 Index(['newColOne', 'newColTwo'], dtype='object')]

In [42]:
df2.shape

(5, 2)

In [43]:
df2.ndim #dimension

2

In [44]:
df2.size # number of elements

10

In [45]:
df2.values

array([[0, 1],
       [2, 3],
       [4, 5],
       [6, 7],
       [8, 9]])

In [46]:
df.head

<bound method NDFrame.head of    variableName
0             1
1             2
2             3
3             4
4             5>

In [48]:
df2.head(2)

   newColOne  newColTwo
0          0          1
1          2          3

In [49]:
df2.tail(2)

   newColOne  newColTwo
3          6          7
4          8          9

In [50]:
a = np.array([1,2,3,4,5])

In [51]:
# pd.Dataframe( value=datas,  columnNames)